{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "REACTOME_GLYCOGEN_BREAKDOWN_GLYCOGENOLYSIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 17], "dtype": "float32", "sparse": false, "name": "REACTOME_GLYCOGEN_BREAKDOWN_GLYCOGENOLYSIS"}, "inbound_nodes": []}, {"name": "REACTOME_TRANSLATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 170], "dtype": "float32", "sparse": false, "name": "REACTOME_TRANSLATION"}, "inbound_nodes": []}, {"name": "REACTOME_PYRIMIDINE_CATABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_PYRIMIDINE_CATABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_RNA_POL_III_TRANSCRIPTION_INITIATION_FROM_TYPE_2_PROMOTER", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "name": "REACTOME_RNA_POL_III_TRANSCRIPTION_INITIATION_FROM_TYPE_2_PROMOTER"}, "inbound_nodes": []}, {"name": "REACTOME_INHIBITION_OF_THE_PROTEOLYTIC_ACTIVITY_OF_APC_C_REQUIRED_FOR_THE_ONSET_OF_ANAPHASE_BY_MITOTIC_SPINDLE_CHECKPOINT_COMPONENTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_INHIBITION_OF_THE_PROTEOLYTIC_ACTIVITY_OF_APC_C_REQUIRED_FOR_THE_ONSET_OF_ANAPHASE_BY_MITOTIC_SPINDLE_CHECKPOINT_COMPONENTS"}, "inbound_nodes": []}, {"name": "REACTOME_PYRUVATE_METABOLISM_AND_CITRIC_ACID_TCA_CYCLE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 41], "dtype": "float32", "sparse": false, "name": "REACTOME_PYRUVATE_METABOLISM_AND_CITRIC_ACID_TCA_CYCLE"}, "inbound_nodes": []}, {"name": "REACTOME_EXTRINSIC_PATHWAY_FOR_APOPTOSIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_EXTRINSIC_PATHWAY_FOR_APOPTOSIS"}, "inbound_nodes": []}, {"name": "REACTOME_PTM_GAMMA_CARBOXYLATION_HYPUSINE_FORMATION_AND_ARYLSULFATASE_ACTIVATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26], "dtype": "float32", "sparse": false, "name": "REACTOME_PTM_GAMMA_CARBOXYLATION_HYPUSINE_FORMATION_AND_ARYLSULFATASE_ACTIVATION"}, "inbound_nodes": []}, {"name": "REACTOME_APOPTOTIC_CLEAVAGE_OF_CELLULAR_PROTEINS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 37], "dtype": "float32", "sparse": false, "name": "REACTOME_APOPTOTIC_CLEAVAGE_OF_CELLULAR_PROTEINS"}, "inbound_nodes": []}, {"name": "REACTOME_RNA_POL_I_TRANSCRIPTION_TERMINATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "REACTOME_RNA_POL_I_TRANSCRIPTION_TERMINATION"}, "inbound_nodes": []}, {"name": "REACTOME_FORMATION_OF_THE_TERNARY_COMPLEX_AND_SUBSEQUENTLY_THE_43S_COMPLEX", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 55], "dtype": "float32", "sparse": false, "name": "REACTOME_FORMATION_OF_THE_TERNARY_COMPLEX_AND_SUBSEQUENTLY_THE_43S_COMPLEX"}, "inbound_nodes": []}, {"name": "REACTOME_ACTIVATION_OF_THE_PRE_REPLICATIVE_COMPLEX", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "REACTOME_ACTIVATION_OF_THE_PRE_REPLICATIVE_COMPLEX"}, "inbound_nodes": []}, {"name": "REACTOME_PROCESSING_OF_INTRONLESS_PRE_MRNAS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14], "dtype": "float32", "sparse": false, "name": "REACTOME_PROCESSING_OF_INTRONLESS_PRE_MRNAS"}, "inbound_nodes": []}, {"name": "REACTOME_GAP_JUNCTION_DEGRADATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_GAP_JUNCTION_DEGRADATION"}, "inbound_nodes": []}, {"name": "REACTOME_BASE_EXCISION_REPAIR", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "REACTOME_BASE_EXCISION_REPAIR"}, "inbound_nodes": []}, {"name": "REACTOME_BILE_ACID_AND_BILE_SALT_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 27], "dtype": "float32", "sparse": false, "name": "REACTOME_BILE_ACID_AND_BILE_SALT_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_BILE_ACIDS_AND_BILE_SALTS_VIA_7ALPHA_HYDROXYCHOLESTEROL", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_BILE_ACIDS_AND_BILE_SALTS_VIA_7ALPHA_HYDROXYCHOLESTEROL"}, "inbound_nodes": []}, {"name": "REACTOME_RECYCLING_OF_BILE_ACIDS_AND_SALTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_RECYCLING_OF_BILE_ACIDS_AND_SALTS"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_RHO_GTPASES", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 112], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_RHO_GTPASES"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_WNT", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 62], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_WNT"}, "inbound_nodes": []}, {"name": "REACTOME_METABOLISM_OF_NON_CODING_RNA", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 49], "dtype": "float32", "sparse": false, "name": "REACTOME_METABOLISM_OF_NON_CODING_RNA"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_BILE_ACIDS_AND_BILE_SALTS_VIA_24_HYDROXYCHOLESTEROL", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_BILE_ACIDS_AND_BILE_SALTS_VIA_24_HYDROXYCHOLESTEROL"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_BILE_ACIDS_AND_BILE_SALTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_BILE_ACIDS_AND_BILE_SALTS"}, "inbound_nodes": []}, {"name": "REACTOME_METABOLISM_OF_STEROID_HORMONES_AND_VITAMINS_A_AND_D", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34], "dtype": "float32", "sparse": false, "name": "REACTOME_METABOLISM_OF_STEROID_HORMONES_AND_VITAMINS_A_AND_D"}, "inbound_nodes": []}, {"name": "REACTOME_ANDROGEN_BIOSYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_ANDROGEN_BIOSYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALLING_BY_NGF", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 212], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALLING_BY_NGF"}, "inbound_nodes": []}, {"name": "REACTOME_CTNNB1_PHOSPHORYLATION_CASCADE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "REACTOME_CTNNB1_PHOSPHORYLATION_CASCADE"}, "inbound_nodes": []}, {"name": "REACTOME_INSULIN_RECEPTOR_RECYCLING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "name": "REACTOME_INSULIN_RECEPTOR_RECYCLING"}, "inbound_nodes": []}, {"name": "REACTOME_COPI_MEDIATED_TRANSPORT", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "name": "REACTOME_COPI_MEDIATED_TRANSPORT"}, "inbound_nodes": []}, {"name": "REACTOME_NEF_MEDIATED_DOWNREGULATION_OF_MHC_CLASS_I_COMPLEX_CELL_SURFACE_EXPRESSION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_NEF_MEDIATED_DOWNREGULATION_OF_MHC_CLASS_I_COMPLEX_CELL_SURFACE_EXPRESSION"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_SCF_KIT", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 75], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_SCF_KIT"}, "inbound_nodes": []}, {"name": "REACTOME_DEVELOPMENTAL_BIOLOGY", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 386], "dtype": "float32", "sparse": false, "name": "REACTOME_DEVELOPMENTAL_BIOLOGY"}, "inbound_nodes": []}, {"name": "REACTOME_CROSS_PRESENTATION_OF_SOLUBLE_EXOGENOUS_ANTIGENS_ENDOSOMES", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 47], "dtype": "float32", "sparse": false, "name": "REACTOME_CROSS_PRESENTATION_OF_SOLUBLE_EXOGENOUS_ANTIGENS_ENDOSOMES"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_NODAL", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_NODAL"}, "inbound_nodes": []}, {"name": "REACTOME_DAG_AND_IP3_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 31], "dtype": "float32", "sparse": false, "name": "REACTOME_DAG_AND_IP3_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_SPRY_REGULATION_OF_FGF_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_SPRY_REGULATION_OF_FGF_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_TCA_CYCLE_AND_RESPIRATORY_ELECTRON_TRANSPORT", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 119], "dtype": "float32", "sparse": false, "name": "REACTOME_TCA_CYCLE_AND_RESPIRATORY_ELECTRON_TRANSPORT"}, "inbound_nodes": []}, {"name": "REACTOME_BMAL1_CLOCK_NPAS2_ACTIVATES_CIRCADIAN_EXPRESSION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 35], "dtype": "float32", "sparse": false, "name": "REACTOME_BMAL1_CLOCK_NPAS2_ACTIVATES_CIRCADIAN_EXPRESSION"}, "inbound_nodes": []}, {"name": "REACTOME_ANTIGEN_PROCESSING_CROSS_PRESENTATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 73], "dtype": "float32", "sparse": false, "name": "REACTOME_ANTIGEN_PROCESSING_CROSS_PRESENTATION"}, "inbound_nodes": []}, {"name": "REACTOME_GROWTH_HORMONE_RECEPTOR_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 24], "dtype": "float32", "sparse": false, "name": "REACTOME_GROWTH_HORMONE_RECEPTOR_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_TRIF_MEDIATED_TLR3_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 72], "dtype": "float32", "sparse": false, "name": "REACTOME_TRIF_MEDIATED_TLR3_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_CELL_CELL_COMMUNICATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 118], "dtype": "float32", "sparse": false, "name": "REACTOME_CELL_CELL_COMMUNICATION"}, "inbound_nodes": []}, {"name": "REACTOME_ABCA_TRANSPORTERS_IN_LIPID_HOMEOSTASIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_ABCA_TRANSPORTERS_IN_LIPID_HOMEOSTASIS"}, "inbound_nodes": []}, {"name": "REACTOME_ENDOSOMAL_VACUOLAR_PATHWAY", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "name": "REACTOME_ENDOSOMAL_VACUOLAR_PATHWAY"}, "inbound_nodes": []}, {"name": "REACTOME_TETRAHYDROBIOPTERIN_BH4_SYNTHESIS_RECYCLING_SALVAGE_AND_REGULATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_TETRAHYDROBIOPTERIN_BH4_SYNTHESIS_RECYCLING_SALVAGE_AND_REGULATION"}, "inbound_nodes": []}, {"name": "REACTOME_ER_PHAGOSOME_PATHWAY", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 59], "dtype": "float32", "sparse": false, "name": "REACTOME_ER_PHAGOSOME_PATHWAY"}, "inbound_nodes": []}, {"name": "REACTOME_MEIOSIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 112], "dtype": "float32", "sparse": false, "name": "REACTOME_MEIOSIS"}, "inbound_nodes": []}, {"name": "REACTOME_NEGATIVE_REGULATION_OF_FGFR_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36], "dtype": "float32", "sparse": false, "name": "REACTOME_NEGATIVE_REGULATION_OF_FGFR_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_G0_AND_EARLY_G1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 24], "dtype": "float32", "sparse": false, "name": "REACTOME_G0_AND_EARLY_G1"}, "inbound_nodes": []}, {"name": "REACTOME_REGULATION_OF_KIT_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "name": "REACTOME_REGULATION_OF_KIT_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_MEMBRANE_TRAFFICKING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 124], "dtype": "float32", "sparse": false, "name": "REACTOME_MEMBRANE_TRAFFICKING"}, "inbound_nodes": []}, {"name": "REACTOME_NEF_MEDIATES_DOWN_MODULATION_OF_CELL_SURFACE_RECEPTORS_BY_RECRUITING_THEM_TO_CLATHRIN_ADAPTERS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "REACTOME_NEF_MEDIATES_DOWN_MODULATION_OF_CELL_SURFACE_RECEPTORS_BY_RECRUITING_THEM_TO_CLATHRIN_ADAPTERS"}, "inbound_nodes": []}, {"name": "REACTOME_IMMUNOREGULATORY_INTERACTIONS_BETWEEN_A_LYMPHOID_AND_A_NON_LYMPHOID_CELL", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 62], "dtype": "float32", "sparse": false, "name": "REACTOME_IMMUNOREGULATORY_INTERACTIONS_BETWEEN_A_LYMPHOID_AND_A_NON_LYMPHOID_CELL"}, "inbound_nodes": []}, {"name": "REACTOME_ACTIVATED_AMPK_STIMULATES_FATTY_ACID_OXIDATION_IN_MUSCLE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_ACTIVATED_AMPK_STIMULATES_FATTY_ACID_OXIDATION_IN_MUSCLE"}, "inbound_nodes": []}, {"name": "REACTOME_VITAMIN_B5_PANTOTHENATE_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_VITAMIN_B5_PANTOTHENATE_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_BOTULINUM_NEUROTOXICITY", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_BOTULINUM_NEUROTOXICITY"}, "inbound_nodes": []}, {"name": "REACTOME_METABOLISM_OF_VITAMINS_AND_COFACTORS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 51], "dtype": "float32", "sparse": false, "name": "REACTOME_METABOLISM_OF_VITAMINS_AND_COFACTORS"}, "inbound_nodes": []}, {"name": "REACTOME_TRANS_GOLGI_NETWORK_VESICLE_BUDDING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 57], "dtype": "float32", "sparse": false, "name": "REACTOME_TRANS_GOLGI_NETWORK_VESICLE_BUDDING"}, "inbound_nodes": []}, {"name": "REACTOME_PROTEOLYTIC_CLEAVAGE_OF_SNARE_COMPLEX_PROTEINS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "name": "REACTOME_PROTEOLYTIC_CLEAVAGE_OF_SNARE_COMPLEX_PROTEINS"}, "inbound_nodes": []}, {"name": "REACTOME_RESOLUTION_OF_AP_SITES_VIA_THE_MULTIPLE_NUCLEOTIDE_PATCH_REPLACEMENT_PATHWAY", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 17], "dtype": "float32", "sparse": false, "name": "REACTOME_RESOLUTION_OF_AP_SITES_VIA_THE_MULTIPLE_NUCLEOTIDE_PATCH_REPLACEMENT_PATHWAY"}, "inbound_nodes": []}, {"name": "REACTOME_GAMMA_CARBOXYLATION_TRANSPORT_AND_AMINO_TERMINAL_CLEAVAGE_OF_PROTEINS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_GAMMA_CARBOXYLATION_TRANSPORT_AND_AMINO_TERMINAL_CLEAVAGE_OF_PROTEINS"}, "inbound_nodes": []}, {"name": "REACTOME_IL_7_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_IL_7_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_CELL_CYCLE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 399], "dtype": "float32", "sparse": false, "name": "REACTOME_CELL_CYCLE"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_ERBB4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 87], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_ERBB4"}, "inbound_nodes": []}, {"name": "REACTOME_ORC1_REMOVAL_FROM_CHROMATIN", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 65], "dtype": "float32", "sparse": false, "name": "REACTOME_ORC1_REMOVAL_FROM_CHROMATIN"}, "inbound_nodes": []}, {"name": "REACTOME_O_LINKED_GLYCOSYLATION_OF_MUCINS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 53], "dtype": "float32", "sparse": false, "name": "REACTOME_O_LINKED_GLYCOSYLATION_OF_MUCINS"}, "inbound_nodes": []}, {"name": "REACTOME_SULFUR_AMINO_ACID_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 24], "dtype": "float32", "sparse": false, "name": "REACTOME_SULFUR_AMINO_ACID_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_DOWNREGULATION_OF_ERBB2_ERBB3_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_DOWNREGULATION_OF_ERBB2_ERBB3_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_ANTIVIRAL_MECHANISM_BY_IFN_STIMULATED_GENES", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 65], "dtype": "float32", "sparse": false, "name": "REACTOME_ANTIVIRAL_MECHANISM_BY_IFN_STIMULATED_GENES"}, "inbound_nodes": []}, {"name": "REACTOME_PROLACTIN_RECEPTOR_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14], "dtype": "float32", "sparse": false, "name": "REACTOME_PROLACTIN_RECEPTOR_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_ERBB2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 97], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_ERBB2"}, "inbound_nodes": []}, {"name": "REACTOME_SPHINGOLIPID_DE_NOVO_BIOSYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "REACTOME_SPHINGOLIPID_DE_NOVO_BIOSYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_TERMINATION_OF_O_GLYCAN_BIOSYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "REACTOME_TERMINATION_OF_O_GLYCAN_BIOSYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_DEFENSINS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 49], "dtype": "float32", "sparse": false, "name": "REACTOME_DEFENSINS"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_CONSTITUTIVELY_ACTIVE_EGFR", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 17], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_CONSTITUTIVELY_ACTIVE_EGFR"}, "inbound_nodes": []}, {"name": "REACTOME_GRB2_EVENTS_IN_ERBB2_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 22], "dtype": "float32", "sparse": false, "name": "REACTOME_GRB2_EVENTS_IN_ERBB2_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_EGFR_IN_CANCER", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 105], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_EGFR_IN_CANCER"}, "inbound_nodes": []}, {"name": "REACTOME_MEMBRANE_BINDING_AND_TARGETTING_OF_GAG_PROTEINS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 9], "dtype": "float32", "sparse": false, "name": "REACTOME_MEMBRANE_BINDING_AND_TARGETTING_OF_GAG_PROTEINS"}, "inbound_nodes": []}, {"name": "REACTOME_BETA_DEFENSINS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 40], "dtype": "float32", "sparse": false, "name": "REACTOME_BETA_DEFENSINS"}, "inbound_nodes": []}, {"name": "REACTOME_SRP_DEPENDENT_COTRANSLATIONAL_PROTEIN_TARGETING_TO_MEMBRANE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 131], "dtype": "float32", "sparse": false, "name": "REACTOME_SRP_DEPENDENT_COTRANSLATIONAL_PROTEIN_TARGETING_TO_MEMBRANE"}, "inbound_nodes": []}, {"name": "REACTOME_PI3K_EVENTS_IN_ERBB4_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36], "dtype": "float32", "sparse": false, "name": "REACTOME_PI3K_EVENTS_IN_ERBB4_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_SHC1_EVENTS_IN_ERBB4_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "REACTOME_SHC1_EVENTS_IN_ERBB4_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_PI3K_EVENTS_IN_ERBB2_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 42], "dtype": "float32", "sparse": false, "name": "REACTOME_PI3K_EVENTS_IN_ERBB2_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_NUCLEAR_SIGNALING_BY_ERBB4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 38], "dtype": "float32", "sparse": false, "name": "REACTOME_NUCLEAR_SIGNALING_BY_ERBB4"}, "inbound_nodes": []}, {"name": "REACTOME_GLYCOSPHINGOLIPID_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 37], "dtype": "float32", "sparse": false, "name": "REACTOME_GLYCOSPHINGOLIPID_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_PPARA_ACTIVATES_GENE_EXPRESSION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 103], "dtype": "float32", "sparse": false, "name": "REACTOME_PPARA_ACTIVATES_GENE_EXPRESSION"}, "inbound_nodes": []}, {"name": "REACTOME_ASSOCIATION_OF_LICENSING_FACTORS_WITH_THE_PRE_REPLICATIVE_COMPLEX", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_ASSOCIATION_OF_LICENSING_FACTORS_WITH_THE_PRE_REPLICATIVE_COMPLEX"}, "inbound_nodes": []}, {"name": "REACTOME_RIP_MEDIATED_NFKB_ACTIVATION_VIA_DAI", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_RIP_MEDIATED_NFKB_ACTIVATION_VIA_DAI"}, "inbound_nodes": []}, {"name": "REACTOME_PRE_NOTCH_TRANSCRIPTION_AND_TRANSLATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "name": "REACTOME_PRE_NOTCH_TRANSCRIPTION_AND_TRANSLATION"}, "inbound_nodes": []}, {"name": "REACTOME_DEGRADATION_OF_THE_EXTRACELLULAR_MATRIX", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 29], "dtype": "float32", "sparse": false, "name": "REACTOME_DEGRADATION_OF_THE_EXTRACELLULAR_MATRIX"}, "inbound_nodes": []}, {"name": "REACTOME_MITOCHONDRIAL_PROTEIN_IMPORT", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 49], "dtype": "float32", "sparse": false, "name": "REACTOME_MITOCHONDRIAL_PROTEIN_IMPORT"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_HIPPO", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_HIPPO"}, "inbound_nodes": []}, {"name": "REACTOME_ACTIVATED_NOTCH1_TRANSMITS_SIGNAL_TO_THE_NUCLEUS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 25], "dtype": "float32", "sparse": false, "name": "REACTOME_ACTIVATED_NOTCH1_TRANSMITS_SIGNAL_TO_THE_NUCLEUS"}, "inbound_nodes": []}, {"name": "REACTOME_TRAFFICKING_AND_PROCESSING_OF_ENDOSOMAL_TLR", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_TRAFFICKING_AND_PROCESSING_OF_ENDOSOMAL_TLR"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_NOTCH4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_NOTCH4"}, "inbound_nodes": []}, {"name": "REACTOME_DOWNSTREAM_SIGNALING_EVENTS_OF_B_CELL_RECEPTOR_BCR", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 92], "dtype": "float32", "sparse": false, "name": "REACTOME_DOWNSTREAM_SIGNALING_EVENTS_OF_B_CELL_RECEPTOR_BCR"}, "inbound_nodes": []}, {"name": "REACTOME_ACTIVATION_OF_NF_KAPPAB_IN_B_CELLS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 61], "dtype": "float32", "sparse": false, "name": "REACTOME_ACTIVATION_OF_NF_KAPPAB_IN_B_CELLS"}, "inbound_nodes": []}, {"name": "REACTOME_RORA_ACTIVATES_CIRCADIAN_EXPRESSION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "name": "REACTOME_RORA_ACTIVATES_CIRCADIAN_EXPRESSION"}, "inbound_nodes": []}, {"name": "REACTOME_ANTIGEN_ACTIVATES_B_CELL_RECEPTOR_LEADING_TO_GENERATION_OF_SECOND_MESSENGERS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 29], "dtype": "float32", "sparse": false, "name": "REACTOME_ANTIGEN_ACTIVATES_B_CELL_RECEPTOR_LEADING_TO_GENERATION_OF_SECOND_MESSENGERS"}, "inbound_nodes": []}, {"name": "REACTOME_REGULATION_OF_COMPLEMENT_CASCADE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_REGULATION_OF_COMPLEMENT_CASCADE"}, "inbound_nodes": []}, {"name": "REACTOME_YAP1_AND_WWTR1_TAZ_STIMULATED_GENE_EXPRESSION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 23], "dtype": "float32", "sparse": false, "name": "REACTOME_YAP1_AND_WWTR1_TAZ_STIMULATED_GENE_EXPRESSION"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_NOTCH2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_NOTCH2"}, "inbound_nodes": []}, {"name": "REACTOME_PRE_NOTCH_EXPRESSION_AND_PROCESSING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 38], "dtype": "float32", "sparse": false, "name": "REACTOME_PRE_NOTCH_EXPRESSION_AND_PROCESSING"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_THE_B_CELL_RECEPTOR_BCR", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 121], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_THE_B_CELL_RECEPTOR_BCR"}, "inbound_nodes": []}, {"name": "REACTOME_EXTRACELLULAR_MATRIX_ORGANIZATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 83], "dtype": "float32", "sparse": false, "name": "REACTOME_EXTRACELLULAR_MATRIX_ORGANIZATION"}, "inbound_nodes": []}, {"name": "REACTOME_NOTCH1_INTRACELLULAR_DOMAIN_REGULATES_TRANSCRIPTION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 44], "dtype": "float32", "sparse": false, "name": "REACTOME_NOTCH1_INTRACELLULAR_DOMAIN_REGULATES_TRANSCRIPTION"}, "inbound_nodes": []}, {"name": "REACTOME_CIRCADIAN_REPRESSION_OF_EXPRESSION_BY_REV_ERBA", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 22], "dtype": "float32", "sparse": false, "name": "REACTOME_CIRCADIAN_REPRESSION_OF_EXPRESSION_BY_REV_ERBA"}, "inbound_nodes": []}, {"name": "REACTOME_PRE_NOTCH_PROCESSING_IN_GOLGI", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "name": "REACTOME_PRE_NOTCH_PROCESSING_IN_GOLGI"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_NOTCH1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 67], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_NOTCH1"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_NOTCH3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_NOTCH3"}, "inbound_nodes": []}, {"name": "REACTOME_TRIGLYCERIDE_BIOSYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 38], "dtype": "float32", "sparse": false, "name": "REACTOME_TRIGLYCERIDE_BIOSYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_INSULIN_RECEPTOR_SIGNALLING_CASCADE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 84], "dtype": "float32", "sparse": false, "name": "REACTOME_INSULIN_RECEPTOR_SIGNALLING_CASCADE"}, "inbound_nodes": []}, {"name": "REACTOME_ARMS_MEDIATED_ACTIVATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 17], "dtype": "float32", "sparse": false, "name": "REACTOME_ARMS_MEDIATED_ACTIVATION"}, "inbound_nodes": []}, {"name": "REACTOME_PROLONGED_ERK_ACTIVATION_EVENTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "REACTOME_PROLONGED_ERK_ACTIVATION_EVENTS"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALLING_TO_RAS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 27], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALLING_TO_RAS"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_BMP", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 22], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_BMP"}, "inbound_nodes": []}, {"name": "REACTOME_CELL_SURFACE_INTERACTIONS_AT_THE_VASCULAR_WALL", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 85], "dtype": "float32", "sparse": false, "name": "REACTOME_CELL_SURFACE_INTERACTIONS_AT_THE_VASCULAR_WALL"}, "inbound_nodes": []}, {"name": "REACTOME_NGF_SIGNALLING_VIA_TRKA_FROM_THE_PLASMA_MEMBRANE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 134], "dtype": "float32", "sparse": false, "name": "REACTOME_NGF_SIGNALLING_VIA_TRKA_FROM_THE_PLASMA_MEMBRANE"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALLING_TO_ERKS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALLING_TO_ERKS"}, "inbound_nodes": []}, {"name": "REACTOME_P38MAPK_EVENTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_P38MAPK_EVENTS"}, "inbound_nodes": []}, {"name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PI", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PI"}, "inbound_nodes": []}, {"name": "REACTOME_TGF_BETA_RECEPTOR_SIGNALING_IN_EMT_EPITHELIAL_TO_MESENCHYMAL_TRANSITION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14], "dtype": "float32", "sparse": false, "name": "REACTOME_TGF_BETA_RECEPTOR_SIGNALING_IN_EMT_EPITHELIAL_TO_MESENCHYMAL_TRANSITION"}, "inbound_nodes": []}, {"name": "REACTOME_DOWNREGULATION_OF_TGF_BETA_RECEPTOR_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "REACTOME_DOWNREGULATION_OF_TGF_BETA_RECEPTOR_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_COLLAGEN_FORMATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 54], "dtype": "float32", "sparse": false, "name": "REACTOME_COLLAGEN_FORMATION"}, "inbound_nodes": []}, {"name": "REACTOME_SMAD2_SMAD3_SMAD4_HETEROTRIMER_REGULATES_TRANSCRIPTION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 25], "dtype": "float32", "sparse": false, "name": "REACTOME_SMAD2_SMAD3_SMAD4_HETEROTRIMER_REGULATES_TRANSCRIPTION"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_FGFR_IN_DISEASE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 122], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_FGFR_IN_DISEASE"}, "inbound_nodes": []}, {"name": "REACTOME_HS_GAG_DEGRADATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "REACTOME_HS_GAG_DEGRADATION"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_PIPS_AT_THE_EARLY_ENDOSOME_MEMBRANE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_PIPS_AT_THE_EARLY_ENDOSOME_MEMBRANE"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALLING_TO_P38_VIA_RIT_AND_RIN", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALLING_TO_P38_VIA_RIT_AND_RIN"}, "inbound_nodes": []}, {"name": "REACTOME_P53_INDEPENDENT_G1_S_DNA_DAMAGE_CHECKPOINT", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 48], "dtype": "float32", "sparse": false, "name": "REACTOME_P53_INDEPENDENT_G1_S_DNA_DAMAGE_CHECKPOINT"}, "inbound_nodes": []}, {"name": "REACTOME_REGULATION_OF_HYPOXIA_INDUCIBLE_FACTOR_HIF_BY_OXYGEN", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 24], "dtype": "float32", "sparse": false, "name": "REACTOME_REGULATION_OF_HYPOXIA_INDUCIBLE_FACTOR_HIF_BY_OXYGEN"}, "inbound_nodes": []}, {"name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PC", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 22], "dtype": "float32", "sparse": false, "name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PC"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_PIPS_AT_THE_GOLGI_MEMBRANE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 17], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_PIPS_AT_THE_GOLGI_MEMBRANE"}, "inbound_nodes": []}, {"name": "REACTOME_TGF_BETA_RECEPTOR_SIGNALING_ACTIVATES_SMADS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 24], "dtype": "float32", "sparse": false, "name": "REACTOME_TGF_BETA_RECEPTOR_SIGNALING_ACTIVATES_SMADS"}, "inbound_nodes": []}, {"name": "REACTOME_ACTIVATED_POINT_MUTANTS_OF_FGFR2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "name": "REACTOME_ACTIVATED_POINT_MUTANTS_OF_FGFR2"}, "inbound_nodes": []}, {"name": "REACTOME_PHOSPHOLIPID_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 195], "dtype": "float32", "sparse": false, "name": "REACTOME_PHOSPHOLIPID_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_CS_DS_DEGRADATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_CS_DS_DEGRADATION"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_PA", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 27], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_PA"}, "inbound_nodes": []}, {"name": "REACTOME_OXYGEN_DEPENDENT_PROLINE_HYDROXYLATION_OF_HYPOXIA_INDUCIBLE_FACTOR_ALPHA", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 17], "dtype": "float32", "sparse": false, "name": "REACTOME_OXYGEN_DEPENDENT_PROLINE_HYDROXYLATION_OF_HYPOXIA_INDUCIBLE_FACTOR_ALPHA"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_PIPS_AT_THE_LATE_ENDOSOME_MEMBRANE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_PIPS_AT_THE_LATE_ENDOSOME_MEMBRANE"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_PE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_PE"}, "inbound_nodes": []}, {"name": "REACTOME_GASTRIN_CREB_SIGNALLING_PATHWAY_VIA_PKC_AND_MAPK", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200], "dtype": "float32", "sparse": false, "name": "REACTOME_GASTRIN_CREB_SIGNALLING_PATHWAY_VIA_PKC_AND_MAPK"}, "inbound_nodes": []}, {"name": "REACTOME_CHONDROITIN_SULFATE_BIOSYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "REACTOME_CHONDROITIN_SULFATE_BIOSYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_HYALURONAN_UPTAKE_AND_DEGRADATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_HYALURONAN_UPTAKE_AND_DEGRADATION"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_FGFR1_MUTANTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 29], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_FGFR1_MUTANTS"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_PIPS_AT_THE_PLASMA_MEMBRANE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_PIPS_AT_THE_PLASMA_MEMBRANE"}, "inbound_nodes": []}, {"name": "REACTOME_THE_ACTIVATION_OF_ARYLSULFATASES", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_THE_ACTIVATION_OF_ARYLSULFATASES"}, "inbound_nodes": []}, {"name": "REACTOME_TRANSCRIPTIONAL_ACTIVITY_OF_SMAD2_SMAD3_SMAD4_HETEROTRIMER", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36], "dtype": "float32", "sparse": false, "name": "REACTOME_TRANSCRIPTIONAL_ACTIVITY_OF_SMAD2_SMAD3_SMAD4_HETEROTRIMER"}, "inbound_nodes": []}, {"name": "REACTOME_HYALURONAN_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 14], "dtype": "float32", "sparse": false, "name": "REACTOME_HYALURONAN_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_DOWNREGULATION_OF_SMAD2_3_SMAD4_TRANSCRIPTIONAL_ACTIVITY", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 19], "dtype": "float32", "sparse": false, "name": "REACTOME_DOWNREGULATION_OF_SMAD2_3_SMAD4_TRANSCRIPTIONAL_ACTIVITY"}, "inbound_nodes": []}, {"name": "REACTOME_KERATAN_SULFATE_BIOSYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 25], "dtype": "float32", "sparse": false, "name": "REACTOME_KERATAN_SULFATE_BIOSYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_REVERSIBLE_HYDRATION_OF_CARBON_DIOXIDE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_REVERSIBLE_HYDRATION_OF_CARBON_DIOXIDE"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_FGFR1_FUSION_MUTANTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_FGFR1_FUSION_MUTANTS"}, "inbound_nodes": []}, {"name": "REACTOME_ALPHA_LINOLENIC_ACID_ALA_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_ALPHA_LINOLENIC_ACID_ALA_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_ACTIVATED_POINT_MUTANTS_OF_FGFR1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_ACTIVATED_POINT_MUTANTS_OF_FGFR1"}, "inbound_nodes": []}, {"name": "REACTOME_PI_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 47], "dtype": "float32", "sparse": false, "name": "REACTOME_PI_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_ABACAVIR_TRANSPORT_AND_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_ABACAVIR_TRANSPORT_AND_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_CHONDROITIN_SULFATE_DERMATAN_SULFATE_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 47], "dtype": "float32", "sparse": false, "name": "REACTOME_CHONDROITIN_SULFATE_DERMATAN_SULFATE_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_LATENT_INFECTION_OF_HOMO_SAPIENS_WITH_MYCOBACTERIUM_TUBERCULOSIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 31], "dtype": "float32", "sparse": false, "name": "REACTOME_LATENT_INFECTION_OF_HOMO_SAPIENS_WITH_MYCOBACTERIUM_TUBERCULOSIS"}, "inbound_nodes": []}, {"name": "REACTOME_SYNTHESIS_OF_PC", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_SYNTHESIS_OF_PC"}, "inbound_nodes": []}, {"name": "REACTOME_HS_GAG_BIOSYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 31], "dtype": "float32", "sparse": false, "name": "REACTOME_HS_GAG_BIOSYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_FGFR3_MUTANTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_FGFR3_MUTANTS"}, "inbound_nodes": []}, {"name": "REACTOME_KERATAN_SULFATE_KERATIN_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 29], "dtype": "float32", "sparse": false, "name": "REACTOME_KERATAN_SULFATE_KERATIN_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_APOPTOSIS_INDUCED_DNA_FRAGMENTATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_APOPTOSIS_INDUCED_DNA_FRAGMENTATION"}, "inbound_nodes": []}, {"name": "REACTOME_KERATAN_SULFATE_DEGRADATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "name": "REACTOME_KERATAN_SULFATE_DEGRADATION"}, "inbound_nodes": []}, {"name": "REACTOME_HEPARAN_SULFATE_HEPARIN_HS_GAG_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 52], "dtype": "float32", "sparse": false, "name": "REACTOME_HEPARAN_SULFATE_HEPARIN_HS_GAG_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_GLYCOSAMINOGLYCAN_METABOLISM", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 108], "dtype": "float32", "sparse": false, "name": "REACTOME_GLYCOSAMINOGLYCAN_METABOLISM"}, "inbound_nodes": []}, {"name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PG", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PG"}, "inbound_nodes": []}, {"name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PE"}, "inbound_nodes": []}, {"name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "REACTOME_ACYL_CHAIN_REMODELLING_OF_PS"}, "inbound_nodes": []}, {"name": "REACTOME_SIGNALING_BY_FGFR_MUTANTS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 43], "dtype": "float32", "sparse": false, "name": "REACTOME_SIGNALING_BY_FGFR_MUTANTS"}, "inbound_nodes": []}, {"name": "REACTOME_MHC_CLASS_II_ANTIGEN_PRESENTATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 88], "dtype": "float32", "sparse": false, "name": "REACTOME_MHC_CLASS_II_ANTIGEN_PRESENTATION"}, "inbound_nodes": []}, {"name": "REACTOME_GLYCEROPHOSPHOLIPID_BIOSYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 82], "dtype": "float32", "sparse": false, "name": "REACTOME_GLYCEROPHOSPHOLIPID_BIOSYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_A_TETRASACCHARIDE_LINKER_SEQUENCE_IS_REQUIRED_FOR_GAG_SYNTHESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 25], "dtype": "float32", "sparse": false, "name": "REACTOME_A_TETRASACCHARIDE_LINKER_SEQUENCE_IS_REQUIRED_FOR_GAG_SYNTHESIS"}, "inbound_nodes": []}, {"name": "REACTOME_CDK_MEDIATED_PHOSPHORYLATION_AND_REMOVAL_OF_CDC6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 46], "dtype": "float32", "sparse": false, "name": "REACTOME_CDK_MEDIATED_PHOSPHORYLATION_AND_REMOVAL_OF_CDC6"}, "inbound_nodes": []}, {"name": "REACTOME_PLATELET_ADHESION_TO_EXPOSED_COLLAGEN", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_PLATELET_ADHESION_TO_EXPOSED_COLLAGEN"}, "inbound_nodes": []}, {"name": "REACTOME_VEGF_LIGAND_RECEPTOR_INTERACTIONS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_VEGF_LIGAND_RECEPTOR_INTERACTIONS"}, "inbound_nodes": []}, {"name": "REACTOME_ENOS_ACTIVATION_AND_REGULATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "REACTOME_ENOS_ACTIVATION_AND_REGULATION"}, "inbound_nodes": []}, {"name": "REACTOME_MICRORNA_MIRNA_BIOGENESIS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "sparse": false, "name": "REACTOME_MICRORNA_MIRNA_BIOGENESIS"}, "inbound_nodes": []}, {"name": "REACTOME_NUCLEAR_EVENTS_KINASE_AND_TRANSCRIPTION_FACTOR_ACTIVATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 24], "dtype": "float32", "sparse": false, "name": "REACTOME_NUCLEAR_EVENTS_KINASE_AND_TRANSCRIPTION_FACTOR_ACTIVATION"}, "inbound_nodes": []}, {"name": "REACTOME_RETROGRADE_NEUROTROPHIN_SIGNALLING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_RETROGRADE_NEUROTROPHIN_SIGNALLING"}, "inbound_nodes": []}, {"name": "REACTOME_ERKS_ARE_INACTIVATED", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_ERKS_ARE_INACTIVATED"}, "inbound_nodes": []}, {"name": "REACTOME_NEGATIVE_REGULATION_OF_THE_PI3K_AKT_NETWORK", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 7], "dtype": "float32", "sparse": false, "name": "REACTOME_NEGATIVE_REGULATION_OF_THE_PI3K_AKT_NETWORK"}, "inbound_nodes": []}, {"name": "REACTOME_PI3K_AKT_ACTIVATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36], "dtype": "float32", "sparse": false, "name": "REACTOME_PI3K_AKT_ACTIVATION"}, "inbound_nodes": []}, {"name": "REACTOME_REGULATORY_RNA_PATHWAYS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "REACTOME_REGULATORY_RNA_PATHWAYS"}, "inbound_nodes": []}, {"name": "REACTOME_EGFR_DOWNREGULATION", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 24], "dtype": "float32", "sparse": false, "name": "REACTOME_EGFR_DOWNREGULATION"}, "inbound_nodes": []}, {"name": "REACTOME_PROCESSING_OF_CAPPED_INTRON_CONTAINING_PRE_MRNA", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 135], "dtype": "float32", "sparse": false, "name": "REACTOME_PROCESSING_OF_CAPPED_INTRON_CONTAINING_PRE_MRNA"}, "inbound_nodes": []}, {"name": "REACTOME_PECAM1_INTERACTIONS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "REACTOME_PECAM1_INTERACTIONS"}, "inbound_nodes": []}, {"name": "REACTOME_TCR_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 51], "dtype": "float32", "sparse": false, "name": "REACTOME_TCR_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_REGULATION_OF_PYRUVATE_DEHYDROGENASE_PDH_COMPLEX", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_REGULATION_OF_PYRUVATE_DEHYDROGENASE_PDH_COMPLEX"}, "inbound_nodes": []}, {"name": "REACTOME_DOWNSTREAM_TCR_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 34], "dtype": "float32", "sparse": false, "name": "REACTOME_DOWNSTREAM_TCR_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_BASIGIN_INTERACTIONS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 25], "dtype": "float32", "sparse": false, "name": "REACTOME_BASIGIN_INTERACTIONS"}, "inbound_nodes": []}, {"name": "REACTOME_AKT_PHOSPHORYLATES_TARGETS_IN_THE_CYTOSOL", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "name": "REACTOME_AKT_PHOSPHORYLATES_TARGETS_IN_THE_CYTOSOL"}, "inbound_nodes": []}, {"name": "REACTOME_GAB1_SIGNALOSOME", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36], "dtype": "float32", "sparse": false, "name": "REACTOME_GAB1_SIGNALOSOME"}, "inbound_nodes": []}, {"name": "REACTOME_SHC1_EVENTS_IN_EGFR_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "REACTOME_SHC1_EVENTS_IN_EGFR_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_ACTIVATION_OF_THE_MRNA_UPON_BINDING_OF_THE_CAP_BINDING_COMPLEX_AND_EIFS_AND_SUBSEQUENT_BINDING_TO_43S", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 63], "dtype": "float32", "sparse": false, "name": "REACTOME_ACTIVATION_OF_THE_MRNA_UPON_BINDING_OF_THE_CAP_BINDING_COMPLEX_AND_EIFS_AND_SUBSEQUENT_BINDING_TO_43S"}, "inbound_nodes": []}, {"name": "REACTOME_PHOSPHORYLATION_OF_CD3_AND_TCR_ZETA_CHAINS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "REACTOME_PHOSPHORYLATION_OF_CD3_AND_TCR_ZETA_CHAINS"}, "inbound_nodes": []}, {"name": "REACTOME_GLUTAMATE_NEUROTRANSMITTER_RELEASE_CYCLE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 15], "dtype": "float32", "sparse": false, "name": "REACTOME_GLUTAMATE_NEUROTRANSMITTER_RELEASE_CYCLE"}, "inbound_nodes": []}, {"name": "REACTOME_TRANSLOCATION_OF_ZAP_70_TO_IMMUNOLOGICAL_SYNAPSE", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13], "dtype": "float32", "sparse": false, "name": "REACTOME_TRANSLOCATION_OF_ZAP_70_TO_IMMUNOLOGICAL_SYNAPSE"}, "inbound_nodes": []}, {"name": "REACTOME_ERK_MAPK_TARGETS", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "name": "REACTOME_ERK_MAPK_TARGETS"}, "inbound_nodes": []}, {"name": "REACTOME_TIE2_SIGNALING", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 17], "dtype": "float32", "sparse": false, "name": "REACTOME_TIE2_SIGNALING"}, "inbound_nodes": []}, {"name": "REACTOME_GENERATION_OF_SECOND_MESSENGER_MOLECULES", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26], "dtype": "float32", "sparse": false, "name": "REACTOME_GENERATION_OF_SECOND_MESSENGER_MOLECULES"}, "inbound_nodes": []}, {"name": "REACTOME_GENERIC_TRANSCRIPTION_PATHWAY", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 336], "dtype": "float32", "sparse": false, "name": "REACTOME_GENERIC_TRANSCRIPTION_PATHWAY"}, "inbound_nodes": []}, {"name": "REACTOME_RESPONSE_TO_ELEVATED_PLATELET_CYTOSOLIC_CA2_", 